{
  "class_name": "Sequential",
  "keras_version": "1.2.1",
  "config": [
    {
      "class_name": "Lambda",
      "config": {
        "function": [
          "ã\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Nç\u0000\u0000\u0000\u0000\u0000ào@ç\u0000\u0000\u0000\u0000\u0000\u0000à?©\u0000)\u0001Ú\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000ú\bmodel.pyÚ\b<lambda>!\u0000\u0000\u0000s\u0000\u0000\u0000\u0000",
          null,
          null
        ],
        "function_type": "lambda",
        "trainable": true,
        "input_dtype": "float32",
        "name": "lambda_1",
        "batch_input_shape": [
          null,
          66,
          200,
          3
        ],
        "arguments": {},
        "output_shape_type": "raw",
        "output_shape": null
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "nb_row": 5,
        "trainable": true,
        "nb_col": 5,
        "batch_input_shape": [
          null,
          66,
          200,
          3
        ],
        "nb_filter": 24,
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "name": "convolution2d_1",
        "border_mode": "valid",
        "W_regularizer": null,
        "activity_regularizer": null,
        "activation": "linear",
        "subsample": [
          2,
          2
        ],
        "bias": true,
        "dim_ordering": "tf"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_1"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "p": 0.001,
        "trainable": true,
        "name": "dropout_1"
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "nb_row": 5,
        "trainable": true,
        "nb_col": 5,
        "b_regularizer": null,
        "name": "convolution2d_2",
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "nb_filter": 36,
        "border_mode": "valid",
        "W_regularizer": null,
        "activity_regularizer": null,
        "activation": "linear",
        "subsample": [
          2,
          2
        ],
        "bias": true,
        "dim_ordering": "tf"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_2"
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "nb_row": 5,
        "trainable": true,
        "nb_col": 5,
        "b_regularizer": null,
        "name": "convolution2d_3",
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "nb_filter": 48,
        "border_mode": "valid",
        "W_regularizer": null,
        "activity_regularizer": null,
        "activation": "linear",
        "subsample": [
          2,
          2
        ],
        "bias": true,
        "dim_ordering": "tf"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_3"
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "nb_row": 3,
        "trainable": true,
        "nb_col": 3,
        "b_regularizer": null,
        "name": "convolution2d_4",
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "nb_filter": 64,
        "border_mode": "valid",
        "W_regularizer": null,
        "activity_regularizer": null,
        "activation": "linear",
        "subsample": [
          1,
          1
        ],
        "bias": true,
        "dim_ordering": "tf"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_4"
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "nb_row": 3,
        "trainable": true,
        "nb_col": 3,
        "b_regularizer": null,
        "name": "convolution2d_5",
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "nb_filter": 64,
        "border_mode": "valid",
        "W_regularizer": null,
        "activity_regularizer": null,
        "activation": "linear",
        "subsample": [
          1,
          1
        ],
        "bias": true,
        "dim_ordering": "tf"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_5"
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "name": "flatten_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "activity_regularizer": null,
        "trainable": true,
        "input_dim": 1152,
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "name": "dense_1",
        "W_regularizer": null,
        "b_regularizer": null,
        "activation": "linear",
        "output_dim": 100,
        "bias": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_6"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "activity_regularizer": null,
        "trainable": true,
        "input_dim": 100,
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "name": "dense_2",
        "W_regularizer": null,
        "b_regularizer": null,
        "activation": "linear",
        "output_dim": 50,
        "bias": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_7"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "activity_regularizer": null,
        "trainable": true,
        "input_dim": 50,
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "name": "dense_3",
        "W_regularizer": null,
        "b_regularizer": null,
        "activation": "linear",
        "output_dim": 10,
        "bias": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_8"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "activity_regularizer": null,
        "trainable": true,
        "input_dim": 10,
        "b_constraint": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "name": "dense_4",
        "W_regularizer": null,
        "b_regularizer": null,
        "activation": "linear",
        "output_dim": 1,
        "bias": true
      }
    }
  ]
}
